In [3]:
import pandas as pd
import matplotlib.pyplot as plt

In [4]:
df = pd.read_csv("2_homeprices.csv")
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       NaN   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000
5  4100       6.0    8  810000

In [5]:
import math
df.bedrooms = df.bedrooms.fillna(df.bedrooms.median())
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       4.0   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000
5  4100       6.0    8  810000

In [7]:
from sklearn.preprocessing import StandardScaler
scaler = StandardScaler()

df1 = scaler.fit_transform(df)
df2 = pd.DataFrame(df1, columns=['area','bedrooms','age','price'])
df2

       area  bedrooms       age     price
0 -1.521622 -1.093216  0.462573 -0.987180
1 -0.776338 -0.156174 -0.198246 -0.836593
2 -0.403696 -0.156174  0.198246 -0.384833
3  0.341589 -1.093216  1.784210 -0.535420
4  1.086873  0.780869 -1.123392  1.121035
5  1.273194  1.717911 -1.123392  1.622991

In [12]:
from sklearn import linear_model as sagar

lr = sagar.LinearRegression()

lr.fit(df.drop('price',axis='columns'),df.price)

LinearRegression()

In [14]:
lr.predict([[3000,3,40]])

array([498408.25158031])

In [15]:
lr.coef_

array([  112.06244194, 23388.88007794, -3231.71790863])

In [16]:
lr.intercept_

221323.00186540408

In [ ]:
y = m1.area + m2.bedroom + m3.age + b

In [18]:
y = 112.06244194*3000 + 23388.88007794*3 - 3231.71790863*40 + 221323.00186540408
y

498408.2515740241